app/views/users/_form.html.haml

SELECT "languages".* FROM "languages" INNER JOIN "known_languages_users" ON "languages"."id" = "known_languages_users"."known_language_id" WHERE "languages"."type" IN ('KnownLanguage') AND "known_languages_users"."user_id" = 2
SELECT 1 AS one FROM "languages" INNER JOIN "desired_languages_users" ON "languages"."id" = "desired_languages_users"."desired_language_id" WHERE "languages"."type" IN ('DesiredLanguage') AND "desired_languages_users"."user_id" IS NULL AND "languages"."id" = 52 LIMIT 1
---
    - @known_languages.each do |language|
      = check_box_tag "user[known_language_ids][]",language.id, @user.known_languages.include?(language)