app/controllers/home_controller.rb

  def index
    @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]