app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", "inbox"]]
UPDATE "messages" SET "unread" = 'f', "updated_at" = '2013-07-21 02:00:02.413804' WHERE "messages"."id" = 9
---
  def show
    @message = Message.find(params[:id])
    @message.update_attributes(:unread => false)

INSERT INTO "messages" ("content", "created_at", "receiver_id", "sender_id", "subject", "unread", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @message = Message.new(params[:message])
    @message.update_attributes(:unread => true)

    if @message.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages" WHERE (receiver_id = User.current_user_id)
---
  def inbox
    @current_user = User.find(session[:user_id])
    @messages = Message.where(receiver_id: @current_user.id)