app/controllers/sessions_controller.rb

  def create
    user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'alexlin' LIMIT 1