app/controllers/users_controller.rb

SELECT users.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((37.7749295 - users.latitude) * PI() / 180 / 2), 2) + COS(37.7749295 * PI() / 180) * COS(users.latitude * PI() / 180) * POWER(SIN((-122.4194155 - users.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(users.longitude - -122.4194155), RADIANS(users.latitude - 37.7749295))) + 360 AS decimal) % 360 AS bearing FROM "users" WHERE (users.latitude BETWEEN 37.34073415066746 AND 38.20912484933254 AND users.longitude BETWEEN -122.96873565173794 AND -121.87009534826205 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((37.7749295 - users.latitude) * PI() / 180 / 2), 2) + COS(37.7749295 * PI() / 180) * COS(users.latitude * PI() / 180) * POWER(SIN((-122.4194155 - users.longitude) * PI() / 180 / 2), 2))) <= 30) ORDER BY distance
---
  def index
    if params[:location_search].present?
      @users = User.near(params[:location_search], 30, :order => :distance)
      # Finds users within 30 miles
    else
      @users = User.all

SELECT "languages".* FROM "languages" WHERE "languages"."type" IN ('KnownLanguage')
---
  def new
    @user = User.new
    @known_languages = KnownLanguage.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "languages".* FROM "languages" WHERE "languages"."type" IN ('KnownLanguage')
---
  def edit
    @user = User.find(params[:id])
    @known_languages = KnownLanguage.all

INSERT INTO "users" ("address", "created_at", "desired_language_id", "email", "gender", "known_language_id", "latitude", "longitude", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "password_digest" = '$2a$10$VZLKEb/M8/OfFyV6ypSL7.Z3.b5.hvgyLDajYuWRGIzpKQ3dpHnHS', "address" = 'San Francisco', "latitude" = 37.7749295, "longitude" = -122.4194155, "updated_at" = '2013-07-21 05:47:21.199893' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])