app/controllers/users_controller.rb

SELECT "languages".* FROM "languages" INNER JOIN "desired_languages_users" ON "languages"."id" = "desired_languages_users"."desired_language_id" WHERE "languages"."type" IN ('DesiredLanguage') AND "desired_languages_users"."user_id" = 1
---
  def index
    if params[:location_search].present?
      @users = User.near(params[:location_search], 30, :order => :distance)
      # Finds users within 30 miles
      @users.select!{|x| x.known_languages.map(&:name).include?(params[:language_search])}